grevaillot/svd_tools/headers/ATSAMV71N21/pmc.h
/** @defgroup pmc_pmc_pcdr0 PMCPCDR0 Peripheral Clock Disable Register 0
@{*/

/** PMC_PMC_PCDR0_PID31 Peripheral Clock 31 Disable **/
#define PMC_PMC_PCDR0_PID31		(1 << 31)
/** PMC_PMC_PCDR0_PID30 Peripheral Clock 30 Disable **/
#define PMC_PMC_PCDR0_PID30		(1 << 30)
/** PMC_PMC_PCDR0_PID29 Peripheral Clock 29 Disable **/
#define PMC_PMC_PCDR0_PID29		(1 << 29)
/** PMC_PMC_PCDR0_PID28 Peripheral Clock 28 Disable **/
#define PMC_PMC_PCDR0_PID28		(1 << 28)
/** PMC_PMC_PCDR0_PID27 Peripheral Clock 27 Disable **/
#define PMC_PMC_PCDR0_PID27		(1 << 27)
/** PMC_PMC_PCDR0_PID26 Peripheral Clock 26 Disable **/
#define PMC_PMC_PCDR0_PID26		(1 << 26)
/** PMC_PMC_PCDR0_PID25 Peripheral Clock 25 Disable **/
#define PMC_PMC_PCDR0_PID25		(1 << 25)
/** PMC_PMC_PCDR0_PID24 Peripheral Clock 24 Disable **/
#define PMC_PMC_PCDR0_PID24		(1 << 24)
/** PMC_PMC_PCDR0_PID23 Peripheral Clock 23 Disable **/
#define PMC_PMC_PCDR0_PID23		(1 << 23)
/** PMC_PMC_PCDR0_PID22 Peripheral Clock 22 Disable **/
#define PMC_PMC_PCDR0_PID22		(1 << 22)
/** PMC_PMC_PCDR0_PID21 Peripheral Clock 21 Disable **/
#define PMC_PMC_PCDR0_PID21		(1 << 21)
/** PMC_PMC_PCDR0_PID20 Peripheral Clock 20 Disable **/
#define PMC_PMC_PCDR0_PID20		(1 << 20)
/** PMC_PMC_PCDR0_PID19 Peripheral Clock 19 Disable **/
#define PMC_PMC_PCDR0_PID19		(1 << 19)
/** PMC_PMC_PCDR0_PID18 Peripheral Clock 18 Disable **/
#define PMC_PMC_PCDR0_PID18		(1 << 18)
/** PMC_PMC_PCDR0_PID17 Peripheral Clock 17 Disable **/
#define PMC_PMC_PCDR0_PID17		(1 << 17)
/** PMC_PMC_PCDR0_PID16 Peripheral Clock 16 Disable **/
#define PMC_PMC_PCDR0_PID16		(1 << 16)
/** PMC_PMC_PCDR0_PID15 Peripheral Clock 15 Disable **/
#define PMC_PMC_PCDR0_PID15		(1 << 15)
/** PMC_PMC_PCDR0_PID14 Peripheral Clock 14 Disable **/
#define PMC_PMC_PCDR0_PID14		(1 << 14)
/** PMC_PMC_PCDR0_PID13 Peripheral Clock 13 Disable **/
#define PMC_PMC_PCDR0_PID13		(1 << 13)
/** PMC_PMC_PCDR0_PID12 Peripheral Clock 12 Disable **/
#define PMC_PMC_PCDR0_PID12		(1 << 12)
/** PMC_PMC_PCDR0_PID11 Peripheral Clock 11 Disable **/
#define PMC_PMC_PCDR0_PID11		(1 << 11)
/** PMC_PMC_PCDR0_PID10 Peripheral Clock 10 Disable **/
#define PMC_PMC_PCDR0_PID10		(1 << 10)
/** PMC_PMC_PCDR0_PID9 Peripheral Clock 9 Disable **/
#define PMC_PMC_PCDR0_PID9		(1 << 9)
/** PMC_PMC_PCDR0_PID8 Peripheral Clock 8 Disable **/
#define PMC_PMC_PCDR0_PID8		(1 << 8)
/** PMC_PMC_PCDR0_PID7 Peripheral Clock 7 Disable **/
#define PMC_PMC_PCDR0_PID7		(1 << 7)

/**@}*/

/** @defgroup pmc_pmc_pcsr0 PMCPCSR0 Peripheral Clock Status Register 0
@{*/

/** PMC_PMC_PCSR0_PID31 Peripheral Clock 31 Status **/
#define PMC_PMC_PCSR0_PID31		(1 << 31)
/** PMC_PMC_PCSR0_PID30 Peripheral Clock 30 Status **/
#define PMC_PMC_PCSR0_PID30		(1 << 30)
/** PMC_PMC_PCSR0_PID29 Peripheral Clock 29 Status **/
#define PMC_PMC_PCSR0_PID29		(1 << 29)
/** PMC_PMC_PCSR0_PID28 Peripheral Clock 28 Status **/
#define PMC_PMC_PCSR0_PID28		(1 << 28)
/** PMC_PMC_PCSR0_PID27 Peripheral Clock 27 Status **/
#define PMC_PMC_PCSR0_PID27		(1 << 27)
/** PMC_PMC_PCSR0_PID26 Peripheral Clock 26 Status **/
#define PMC_PMC_PCSR0_PID26		(1 << 26)
/** PMC_PMC_PCSR0_PID25 Peripheral Clock 25 Status **/
#define PMC_PMC_PCSR0_PID25		(1 << 25)
/** PMC_PMC_PCSR0_PID24 Peripheral Clock 24 Status **/
#define PMC_PMC_PCSR0_PID24		(1 << 24)
/** PMC_PMC_PCSR0_PID23 Peripheral Clock 23 Status **/
#define PMC_PMC_PCSR0_PID23		(1 << 23)
/** PMC_PMC_PCSR0_PID22 Peripheral Clock 22 Status **/
#define PMC_PMC_PCSR0_PID22		(1 << 22)
/** PMC_PMC_PCSR0_PID21 Peripheral Clock 21 Status **/
#define PMC_PMC_PCSR0_PID21		(1 << 21)
/** PMC_PMC_PCSR0_PID20 Peripheral Clock 20 Status **/
#define PMC_PMC_PCSR0_PID20		(1 << 20)
/** PMC_PMC_PCSR0_PID19 Peripheral Clock 19 Status **/
#define PMC_PMC_PCSR0_PID19		(1 << 19)
/** PMC_PMC_PCSR0_PID18 Peripheral Clock 18 Status **/
#define PMC_PMC_PCSR0_PID18		(1 << 18)
/** PMC_PMC_PCSR0_PID17 Peripheral Clock 17 Status **/
#define PMC_PMC_PCSR0_PID17		(1 << 17)
/** PMC_PMC_PCSR0_PID16 Peripheral Clock 16 Status **/
#define PMC_PMC_PCSR0_PID16		(1 << 16)
/** PMC_PMC_PCSR0_PID15 Peripheral Clock 15 Status **/
#define PMC_PMC_PCSR0_PID15		(1 << 15)
/** PMC_PMC_PCSR0_PID14 Peripheral Clock 14 Status **/
#define PMC_PMC_PCSR0_PID14		(1 << 14)
/** PMC_PMC_PCSR0_PID13 Peripheral Clock 13 Status **/
#define PMC_PMC_PCSR0_PID13		(1 << 13)
/** PMC_PMC_PCSR0_PID12 Peripheral Clock 12 Status **/
#define PMC_PMC_PCSR0_PID12		(1 << 12)
/** PMC_PMC_PCSR0_PID11 Peripheral Clock 11 Status **/
#define PMC_PMC_PCSR0_PID11		(1 << 11)
/** PMC_PMC_PCSR0_PID10 Peripheral Clock 10 Status **/
#define PMC_PMC_PCSR0_PID10		(1 << 10)
/** PMC_PMC_PCSR0_PID9 Peripheral Clock 9 Status **/
#define PMC_PMC_PCSR0_PID9		(1 << 9)
/** PMC_PMC_PCSR0_PID8 Peripheral Clock 8 Status **/
#define PMC_PMC_PCSR0_PID8		(1 << 8)
/** PMC_PMC_PCSR0_PID7 Peripheral Clock 7 Status **/
#define PMC_PMC_PCSR0_PID7		(1 << 7)

/**@}*/

/** @defgroup pmc_ckgr_uckr CKGRUCKR UTMI Clock Register
@{*/


#define PMC_CKGR_UCKR_UPLLCOUNT_SHIFT		20
#define PMC_CKGR_UCKR_UPLLCOUNT_MASK		0x0f
/** @defgroup pmc_ckgr_uckr_upllcount UPLLCOUNT UTMI PLL Startup Time
@{*/
/**@}*/

/** PMC_CKGR_UCKR_UPLLEN UTMI PLL Enable **/
#define PMC_CKGR_UCKR_UPLLEN		(1 << 16)

/**@}*/

/** @defgroup pmc_ckgr_mor CKGRMOR Main Oscillator Register
@{*/

/** PMC_CKGR_MOR_XT32KFME 32.768 kHz Crystal Oscillator Frequency Monitoring Enable **/
#define PMC_CKGR_MOR_XT32KFME		(1 << 26)
/** PMC_CKGR_MOR_CFDEN Clock Failure Detector Enable **/
#define PMC_CKGR_MOR_CFDEN		(1 << 25)
/** PMC_CKGR_MOR_MOSCSEL Main Clock Oscillator Selection **/
#define PMC_CKGR_MOR_MOSCSEL		(1 << 24)

#define PMC_CKGR_MOR_KEY_SHIFT		16
#define PMC_CKGR_MOR_KEY_MASK		0xff
/** @defgroup pmc_ckgr_mor_key KEY Write Access Password
@{*/
/**@}*/


#define PMC_CKGR_MOR_MOSCXTST_SHIFT		8
#define PMC_CKGR_MOR_MOSCXTST_MASK		0xff
/** @defgroup pmc_ckgr_mor_moscxtst MOSCXTST Main Crystal Oscillator Startup Time
@{*/
/**@}*/


#define PMC_CKGR_MOR_MOSCRCF_SHIFT		4
#define PMC_CKGR_MOR_MOSCRCF_MASK		0x07
/** @defgroup pmc_ckgr_mor_moscrcf MOSCRCF Main RC Oscillator Frequency Selection
@{*/
/**@}*/

