grevaillot/svd_tools/headers/ATSAMV71N21/pmc.h
/** @defgroup pmc_pmc_imr PMCIMR Interrupt Mask Register
@{*/

/** PMC_PMC_IMR_XT32KERR 32.768 kHz Crystal Oscillator Error Interrupt Mask **/
#define PMC_PMC_IMR_XT32KERR		(1 << 21)
/** PMC_PMC_IMR_CFDEV Clock Failure Detector Event Interrupt Mask **/
#define PMC_PMC_IMR_CFDEV		(1 << 18)
/** PMC_PMC_IMR_MOSCRCS Main RC Status Interrupt Mask **/
#define PMC_PMC_IMR_MOSCRCS		(1 << 17)
/** PMC_PMC_IMR_MOSCSELS Main Clock Source Oscillator Selection Status Interrupt Mask **/
#define PMC_PMC_IMR_MOSCSELS		(1 << 16)
/** PMC_PMC_IMR_PCKRDY6 Programmable Clock Ready 6 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY6		(1 << 14)
/** PMC_PMC_IMR_PCKRDY5 Programmable Clock Ready 5 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY5		(1 << 13)
/** PMC_PMC_IMR_PCKRDY4 Programmable Clock Ready 4 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY4		(1 << 12)
/** PMC_PMC_IMR_PCKRDY3 Programmable Clock Ready 3 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY3		(1 << 11)
/** PMC_PMC_IMR_PCKRDY2 Programmable Clock Ready 2 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY2		(1 << 10)
/** PMC_PMC_IMR_PCKRDY1 Programmable Clock Ready 1 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY1		(1 << 9)
/** PMC_PMC_IMR_PCKRDY0 Programmable Clock Ready 0 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY0		(1 << 8)
/** PMC_PMC_IMR_LOCKU UTMI PLL Lock Interrupt Mask **/
#define PMC_PMC_IMR_LOCKU		(1 << 6)
/** PMC_PMC_IMR_MCKRDY Master Clock Ready Interrupt Mask **/
#define PMC_PMC_IMR_MCKRDY		(1 << 3)
/** PMC_PMC_IMR_LOCKA PLLA Lock Interrupt Mask **/
#define PMC_PMC_IMR_LOCKA		(1 << 1)
/** PMC_PMC_IMR_MOSCXTS Main Crystal Oscillator Status Interrupt Mask **/
#define PMC_PMC_IMR_MOSCXTS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_fsmr PMCFSMR Fast Startup Mode Register
@{*/

/** PMC_PMC_FSMR_FFLPM Force Flash Low-power Mode **/
#define PMC_PMC_FSMR_FFLPM		(1 << 23)

#define PMC_PMC_FSMR_FLPM_SHIFT		21
#define PMC_PMC_FSMR_FLPM_MASK		0x03
/** @defgroup pmc_pmc_fsmr_flpm FLPM Flash Low-power Mode
@{*/
/**@}*/

/** PMC_PMC_FSMR_LPM Low-power Mode **/
#define PMC_PMC_FSMR_LPM		(1 << 20)
/** PMC_PMC_FSMR_USBAL USB Alarm Enable **/
#define PMC_PMC_FSMR_USBAL		(1 << 18)
/** PMC_PMC_FSMR_RTCAL RTC Alarm Enable **/
#define PMC_PMC_FSMR_RTCAL		(1 << 17)
/** PMC_PMC_FSMR_RTTAL RTT Alarm Enable **/
#define PMC_PMC_FSMR_RTTAL		(1 << 16)
/** PMC_PMC_FSMR_FSTT15 Fast Startup Input Enable 15 **/
#define PMC_PMC_FSMR_FSTT15		(1 << 15)
/** PMC_PMC_FSMR_FSTT14 Fast Startup Input Enable 14 **/
#define PMC_PMC_FSMR_FSTT14		(1 << 14)
/** PMC_PMC_FSMR_FSTT13 Fast Startup Input Enable 13 **/
#define PMC_PMC_FSMR_FSTT13		(1 << 13)
/** PMC_PMC_FSMR_FSTT12 Fast Startup Input Enable 12 **/
#define PMC_PMC_FSMR_FSTT12		(1 << 12)
/** PMC_PMC_FSMR_FSTT11 Fast Startup Input Enable 11 **/
#define PMC_PMC_FSMR_FSTT11		(1 << 11)
/** PMC_PMC_FSMR_FSTT10 Fast Startup Input Enable 10 **/
#define PMC_PMC_FSMR_FSTT10		(1 << 10)
/** PMC_PMC_FSMR_FSTT9 Fast Startup Input Enable 9 **/
#define PMC_PMC_FSMR_FSTT9		(1 << 9)
/** PMC_PMC_FSMR_FSTT8 Fast Startup Input Enable 8 **/
#define PMC_PMC_FSMR_FSTT8		(1 << 8)
/** PMC_PMC_FSMR_FSTT7 Fast Startup Input Enable 7 **/
#define PMC_PMC_FSMR_FSTT7		(1 << 7)
/** PMC_PMC_FSMR_FSTT6 Fast Startup Input Enable 6 **/
#define PMC_PMC_FSMR_FSTT6		(1 << 6)
/** PMC_PMC_FSMR_FSTT5 Fast Startup Input Enable 5 **/
#define PMC_PMC_FSMR_FSTT5		(1 << 5)
/** PMC_PMC_FSMR_FSTT4 Fast Startup Input Enable 4 **/
#define PMC_PMC_FSMR_FSTT4		(1 << 4)
/** PMC_PMC_FSMR_FSTT3 Fast Startup Input Enable 3 **/
#define PMC_PMC_FSMR_FSTT3		(1 << 3)
/** PMC_PMC_FSMR_FSTT2 Fast Startup Input Enable 2 **/
#define PMC_PMC_FSMR_FSTT2		(1 << 2)
/** PMC_PMC_FSMR_FSTT1 Fast Startup Input Enable 1 **/
#define PMC_PMC_FSMR_FSTT1		(1 << 1)
/** PMC_PMC_FSMR_FSTT0 Fast Startup Input Enable 0 **/
#define PMC_PMC_FSMR_FSTT0		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_fspr PMCFSPR Fast Startup Polarity Register
@{*/

/** PMC_PMC_FSPR_FSTP15 Fast Startup Input Polarity 15 **/
#define PMC_PMC_FSPR_FSTP15		(1 << 15)
/** PMC_PMC_FSPR_FSTP14 Fast Startup Input Polarity 14 **/
#define PMC_PMC_FSPR_FSTP14		(1 << 14)
/** PMC_PMC_FSPR_FSTP13 Fast Startup Input Polarity 13 **/
#define PMC_PMC_FSPR_FSTP13		(1 << 13)
/** PMC_PMC_FSPR_FSTP12 Fast Startup Input Polarity 12 **/
#define PMC_PMC_FSPR_FSTP12		(1 << 12)
/** PMC_PMC_FSPR_FSTP11 Fast Startup Input Polarity 11 **/
#define PMC_PMC_FSPR_FSTP11		(1 << 11)
/** PMC_PMC_FSPR_FSTP10 Fast Startup Input Polarity 10 **/
#define PMC_PMC_FSPR_FSTP10		(1 << 10)
/** PMC_PMC_FSPR_FSTP9 Fast Startup Input Polarity 9 **/
#define PMC_PMC_FSPR_FSTP9		(1 << 9)
/** PMC_PMC_FSPR_FSTP8 Fast Startup Input Polarity 8 **/
#define PMC_PMC_FSPR_FSTP8		(1 << 8)
/** PMC_PMC_FSPR_FSTP7 Fast Startup Input Polarity 7 **/
#define PMC_PMC_FSPR_FSTP7		(1 << 7)
/** PMC_PMC_FSPR_FSTP6 Fast Startup Input Polarity 6 **/
#define PMC_PMC_FSPR_FSTP6		(1 << 6)
/** PMC_PMC_FSPR_FSTP5 Fast Startup Input Polarity 5 **/
#define PMC_PMC_FSPR_FSTP5		(1 << 5)
/** PMC_PMC_FSPR_FSTP4 Fast Startup Input Polarity 4 **/
#define PMC_PMC_FSPR_FSTP4		(1 << 4)
/** PMC_PMC_FSPR_FSTP3 Fast Startup Input Polarity 3 **/
#define PMC_PMC_FSPR_FSTP3		(1 << 3)
/** PMC_PMC_FSPR_FSTP2 Fast Startup Input Polarity 2 **/
#define PMC_PMC_FSPR_FSTP2		(1 << 2)
/** PMC_PMC_FSPR_FSTP1 Fast Startup Input Polarity 1 **/
#define PMC_PMC_FSPR_FSTP1		(1 << 1)
/** PMC_PMC_FSPR_FSTP0 Fast Startup Input Polarity 0 **/
#define PMC_PMC_FSPR_FSTP0		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_focr PMCFOCR Fault Output Clear Register
@{*/

/** PMC_PMC_FOCR_FOCLR Fault Output Clear **/
#define PMC_PMC_FOCR_FOCLR		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_wpmr PMCWPMR Write Protection Mode Register
@{*/


#define PMC_PMC_WPMR_WPKEY_SHIFT		8
#define PMC_PMC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup pmc_pmc_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** PMC_PMC_WPMR_WPEN Write Protection Enable **/
#define PMC_PMC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_wpsr PMCWPSR Write Protection Status Register
@{*/


#define PMC_PMC_WPSR_WPVSRC_SHIFT		8
#define PMC_PMC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pmc_pmc_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** PMC_PMC_WPSR_WPVS Write Protection Violation Status **/
#define PMC_PMC_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_version PMCVERSION Version Register
@{*/


#define PMC_PMC_VERSION_MFN_SHIFT		16
#define PMC_PMC_VERSION_MFN_MASK		0x07
/** @defgroup pmc_pmc_version_mfn MFN Metal Fix Number
@{*/
/**@}*/


#define PMC_PMC_VERSION_VERSION_SHIFT		0
#define PMC_PMC_VERSION_VERSION_MASK		0xfff
/** @defgroup pmc_pmc_version_version VERSION Version of the Hardware Module
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pcer1 PMCPCER1 Peripheral Clock Enable Register 1
@{*/

/** PMC_PMC_PCER1_PID60 Peripheral Clock 60 Enable **/
#define PMC_PMC_PCER1_PID60		(1 << 28)
/** PMC_PMC_PCER1_PID59 Peripheral Clock 59 Enable **/
#define PMC_PMC_PCER1_PID59		(1 << 27)
/** PMC_PMC_PCER1_PID58 Peripheral Clock 58 Enable **/
#define PMC_PMC_PCER1_PID58		(1 << 26)
/** PMC_PMC_PCER1_PID57 Peripheral Clock 57 Enable **/
#define PMC_PMC_PCER1_PID57		(1 << 25)
/** PMC_PMC_PCER1_PID56 Peripheral Clock 56 Enable **/
#define PMC_PMC_PCER1_PID56		(1 << 24)
/** PMC_PMC_PCER1_PID53 Peripheral Clock 53 Enable **/
#define PMC_PMC_PCER1_PID53		(1 << 21)
/** PMC_PMC_PCER1_PID52 Peripheral Clock 52 Enable **/
#define PMC_PMC_PCER1_PID52		(1 << 20)
/** PMC_PMC_PCER1_PID51 Peripheral Clock 51 Enable **/
#define PMC_PMC_PCER1_PID51		(1 << 19)
/** PMC_PMC_PCER1_PID50 Peripheral Clock 50 Enable **/
#define PMC_PMC_PCER1_PID50		(1 << 18)
/** PMC_PMC_PCER1_PID49 Peripheral Clock 49 Enable **/
#define PMC_PMC_PCER1_PID49		(1 << 17)
/** PMC_PMC_PCER1_PID48 Peripheral Clock 48 Enable **/
#define PMC_PMC_PCER1_PID48		(1 << 16)
/** PMC_PMC_PCER1_PID47 Peripheral Clock 47 Enable **/
#define PMC_PMC_PCER1_PID47		(1 << 15)
/** PMC_PMC_PCER1_PID46 Peripheral Clock 46 Enable **/
#define PMC_PMC_PCER1_PID46		(1 << 14)
/** PMC_PMC_PCER1_PID45 Peripheral Clock 45 Enable **/
#define PMC_PMC_PCER1_PID45		(1 << 13)
/** PMC_PMC_PCER1_PID44 Peripheral Clock 44 Enable **/
#define PMC_PMC_PCER1_PID44		(1 << 12)
/** PMC_PMC_PCER1_PID43 Peripheral Clock 43 Enable **/
#define PMC_PMC_PCER1_PID43		(1 << 11)
/** PMC_PMC_PCER1_PID42 Peripheral Clock 42 Enable **/
#define PMC_PMC_PCER1_PID42		(1 << 10)
/** PMC_PMC_PCER1_PID41 Peripheral Clock 41 Enable **/
#define PMC_PMC_PCER1_PID41		(1 << 9)
/** PMC_PMC_PCER1_PID40 Peripheral Clock 40 Enable **/
#define PMC_PMC_PCER1_PID40		(1 << 8)
/** PMC_PMC_PCER1_PID39 Peripheral Clock 39 Enable **/
#define PMC_PMC_PCER1_PID39		(1 << 7)
/** PMC_PMC_PCER1_PID37 Peripheral Clock 37 Enable **/
#define PMC_PMC_PCER1_PID37		(1 << 5)
/** PMC_PMC_PCER1_PID35 Peripheral Clock 35 Enable **/
#define PMC_PMC_PCER1_PID35		(1 << 3)
/** PMC_PMC_PCER1_PID34 Peripheral Clock 34 Enable **/
#define PMC_PMC_PCER1_PID34		(1 << 2)
/** PMC_PMC_PCER1_PID33 Peripheral Clock 33 Enable **/
#define PMC_PMC_PCER1_PID33		(1 << 1)
/** PMC_PMC_PCER1_PID32 Peripheral Clock 32 Enable **/
#define PMC_PMC_PCER1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcdr1 PMCPCDR1 Peripheral Clock Disable Register 1
@{*/

