grevaillot/svd_tools/headers/ATSAMV71N21/pmc.h
/** PMC_PMC_PCDR1_PID60 Peripheral Clock 60 Disable **/
#define PMC_PMC_PCDR1_PID60		(1 << 28)
/** PMC_PMC_PCDR1_PID59 Peripheral Clock 59 Disable **/
#define PMC_PMC_PCDR1_PID59		(1 << 27)
/** PMC_PMC_PCDR1_PID58 Peripheral Clock 58 Disable **/
#define PMC_PMC_PCDR1_PID58		(1 << 26)
/** PMC_PMC_PCDR1_PID57 Peripheral Clock 57 Disable **/
#define PMC_PMC_PCDR1_PID57		(1 << 25)
/** PMC_PMC_PCDR1_PID56 Peripheral Clock 56 Disable **/
#define PMC_PMC_PCDR1_PID56		(1 << 24)
/** PMC_PMC_PCDR1_PID53 Peripheral Clock 53 Disable **/
#define PMC_PMC_PCDR1_PID53		(1 << 21)
/** PMC_PMC_PCDR1_PID52 Peripheral Clock 52 Disable **/
#define PMC_PMC_PCDR1_PID52		(1 << 20)
/** PMC_PMC_PCDR1_PID51 Peripheral Clock 51 Disable **/
#define PMC_PMC_PCDR1_PID51		(1 << 19)
/** PMC_PMC_PCDR1_PID50 Peripheral Clock 50 Disable **/
#define PMC_PMC_PCDR1_PID50		(1 << 18)
/** PMC_PMC_PCDR1_PID49 Peripheral Clock 49 Disable **/
#define PMC_PMC_PCDR1_PID49		(1 << 17)
/** PMC_PMC_PCDR1_PID48 Peripheral Clock 48 Disable **/
#define PMC_PMC_PCDR1_PID48		(1 << 16)
/** PMC_PMC_PCDR1_PID47 Peripheral Clock 47 Disable **/
#define PMC_PMC_PCDR1_PID47		(1 << 15)
/** PMC_PMC_PCDR1_PID46 Peripheral Clock 46 Disable **/
#define PMC_PMC_PCDR1_PID46		(1 << 14)
/** PMC_PMC_PCDR1_PID45 Peripheral Clock 45 Disable **/
#define PMC_PMC_PCDR1_PID45		(1 << 13)
/** PMC_PMC_PCDR1_PID44 Peripheral Clock 44 Disable **/
#define PMC_PMC_PCDR1_PID44		(1 << 12)
/** PMC_PMC_PCDR1_PID43 Peripheral Clock 43 Disable **/
#define PMC_PMC_PCDR1_PID43		(1 << 11)
/** PMC_PMC_PCDR1_PID42 Peripheral Clock 42 Disable **/
#define PMC_PMC_PCDR1_PID42		(1 << 10)
/** PMC_PMC_PCDR1_PID41 Peripheral Clock 41 Disable **/
#define PMC_PMC_PCDR1_PID41		(1 << 9)
/** PMC_PMC_PCDR1_PID40 Peripheral Clock 40 Disable **/
#define PMC_PMC_PCDR1_PID40		(1 << 8)
/** PMC_PMC_PCDR1_PID39 Peripheral Clock 39 Disable **/
#define PMC_PMC_PCDR1_PID39		(1 << 7)
/** PMC_PMC_PCDR1_PID37 Peripheral Clock 37 Disable **/
#define PMC_PMC_PCDR1_PID37		(1 << 5)
/** PMC_PMC_PCDR1_PID35 Peripheral Clock 35 Disable **/
#define PMC_PMC_PCDR1_PID35		(1 << 3)
/** PMC_PMC_PCDR1_PID34 Peripheral Clock 34 Disable **/
#define PMC_PMC_PCDR1_PID34		(1 << 2)
/** PMC_PMC_PCDR1_PID33 Peripheral Clock 33 Disable **/
#define PMC_PMC_PCDR1_PID33		(1 << 1)
/** PMC_PMC_PCDR1_PID32 Peripheral Clock 32 Disable **/
#define PMC_PMC_PCDR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcsr1 PMCPCSR1 Peripheral Clock Status Register 1
@{*/

/** PMC_PMC_PCSR1_PID60 Peripheral Clock 60 Status **/
#define PMC_PMC_PCSR1_PID60		(1 << 28)
/** PMC_PMC_PCSR1_PID59 Peripheral Clock 59 Status **/
#define PMC_PMC_PCSR1_PID59		(1 << 27)
/** PMC_PMC_PCSR1_PID58 Peripheral Clock 58 Status **/
#define PMC_PMC_PCSR1_PID58		(1 << 26)
/** PMC_PMC_PCSR1_PID57 Peripheral Clock 57 Status **/
#define PMC_PMC_PCSR1_PID57		(1 << 25)
/** PMC_PMC_PCSR1_PID56 Peripheral Clock 56 Status **/
#define PMC_PMC_PCSR1_PID56		(1 << 24)
/** PMC_PMC_PCSR1_PID53 Peripheral Clock 53 Status **/
#define PMC_PMC_PCSR1_PID53		(1 << 21)
/** PMC_PMC_PCSR1_PID52 Peripheral Clock 52 Status **/
#define PMC_PMC_PCSR1_PID52		(1 << 20)
/** PMC_PMC_PCSR1_PID51 Peripheral Clock 51 Status **/
#define PMC_PMC_PCSR1_PID51		(1 << 19)
/** PMC_PMC_PCSR1_PID50 Peripheral Clock 50 Status **/
#define PMC_PMC_PCSR1_PID50		(1 << 18)
/** PMC_PMC_PCSR1_PID49 Peripheral Clock 49 Status **/
#define PMC_PMC_PCSR1_PID49		(1 << 17)
/** PMC_PMC_PCSR1_PID48 Peripheral Clock 48 Status **/
#define PMC_PMC_PCSR1_PID48		(1 << 16)
/** PMC_PMC_PCSR1_PID47 Peripheral Clock 47 Status **/
#define PMC_PMC_PCSR1_PID47		(1 << 15)
/** PMC_PMC_PCSR1_PID46 Peripheral Clock 46 Status **/
#define PMC_PMC_PCSR1_PID46		(1 << 14)
/** PMC_PMC_PCSR1_PID45 Peripheral Clock 45 Status **/
#define PMC_PMC_PCSR1_PID45		(1 << 13)
/** PMC_PMC_PCSR1_PID44 Peripheral Clock 44 Status **/
#define PMC_PMC_PCSR1_PID44		(1 << 12)
/** PMC_PMC_PCSR1_PID43 Peripheral Clock 43 Status **/
#define PMC_PMC_PCSR1_PID43		(1 << 11)
/** PMC_PMC_PCSR1_PID42 Peripheral Clock 42 Status **/
#define PMC_PMC_PCSR1_PID42		(1 << 10)
/** PMC_PMC_PCSR1_PID41 Peripheral Clock 41 Status **/
#define PMC_PMC_PCSR1_PID41		(1 << 9)
/** PMC_PMC_PCSR1_PID40 Peripheral Clock 40 Status **/
#define PMC_PMC_PCSR1_PID40		(1 << 8)
/** PMC_PMC_PCSR1_PID39 Peripheral Clock 39 Status **/
#define PMC_PMC_PCSR1_PID39		(1 << 7)
/** PMC_PMC_PCSR1_PID37 Peripheral Clock 37 Status **/
#define PMC_PMC_PCSR1_PID37		(1 << 5)
/** PMC_PMC_PCSR1_PID35 Peripheral Clock 35 Status **/
#define PMC_PMC_PCSR1_PID35		(1 << 3)
/** PMC_PMC_PCSR1_PID34 Peripheral Clock 34 Status **/
#define PMC_PMC_PCSR1_PID34		(1 << 2)
/** PMC_PMC_PCSR1_PID33 Peripheral Clock 33 Status **/
#define PMC_PMC_PCSR1_PID33		(1 << 1)
/** PMC_PMC_PCSR1_PID32 Peripheral Clock 32 Status **/
#define PMC_PMC_PCSR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcr PMCPCR Peripheral Control Register
@{*/

/** PMC_PMC_PCR_GCLKEN Generic Clock Enable **/
#define PMC_PMC_PCR_GCLKEN		(1 << 29)
/** PMC_PMC_PCR_EN Enable **/
#define PMC_PMC_PCR_EN		(1 << 28)

#define PMC_PMC_PCR_GCLKDIV_SHIFT		20
#define PMC_PMC_PCR_GCLKDIV_MASK		0xff
/** @defgroup pmc_pmc_pcr_gclkdiv GCLKDIV Generic Clock Division Ratio
@{*/
/**@}*/

/** PMC_PMC_PCR_CMD Command **/
#define PMC_PMC_PCR_CMD		(1 << 12)

#define PMC_PMC_PCR_GCLKCSS_SHIFT		8
#define PMC_PMC_PCR_GCLKCSS_MASK		0x07
/** @defgroup pmc_pmc_pcr_gclkcss GCLKCSS Generic Clock Source Selection
@{*/
/**@}*/


#define PMC_PMC_PCR_PID_SHIFT		0
#define PMC_PMC_PCR_PID_MASK		0x7f
/** @defgroup pmc_pmc_pcr_pid PID Peripheral ID
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_ocr PMCOCR Oscillator Calibration Register
@{*/

/** PMC_PMC_OCR_SEL12 Selection of Main RC Oscillator Calibration Bits for 12 MHz **/
#define PMC_PMC_OCR_SEL12		(1 << 23)

#define PMC_PMC_OCR_CAL12_SHIFT		16
#define PMC_PMC_OCR_CAL12_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal12 CAL12 Main RC Oscillator Calibration Bits for 12 MHz
@{*/
/**@}*/

/** PMC_PMC_OCR_SEL8 Selection of Main RC Oscillator Calibration Bits for 8 MHz **/
#define PMC_PMC_OCR_SEL8		(1 << 15)

#define PMC_PMC_OCR_CAL8_SHIFT		8
#define PMC_PMC_OCR_CAL8_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal8 CAL8 Main RC Oscillator Calibration Bits for 8 MHz
@{*/
/**@}*/

/** PMC_PMC_OCR_SEL4 Selection of Main RC Oscillator Calibration Bits for 4 MHz **/
#define PMC_PMC_OCR_SEL4		(1 << 7)

#define PMC_PMC_OCR_CAL4_SHIFT		0
#define PMC_PMC_OCR_CAL4_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal4 CAL4 Main RC Oscillator Calibration Bits for 4 MHz
@{*/
/**@}*/


/**@}*/

